{"Articles/From-LLMs-to-Agentic-AI":{"slug":"Articles/From-LLMs-to-Agentic-AI","filePath":"Articles/From LLMs to Agentic AI.md","title":"From LLMs to Agentic AI","links":[],"tags":["ai"],"content":"This entry breaks down the architectural evolution of modern AI systems as shown in the diagram, moving from simple Large Language Model workflows to fully agentic, multi agent systems.\n\nPicture from “Agentic Design Patterns: A Hands-On Guide to Building Intelligent Systems by Antonio Gulli”\n1. Basic LLM Workflow\nThe most fundamental setup is the classic LLM workflow. A user provides a prompt, which may optionally pass through simple rule based triggers such as formatting checks, routing logic, or safety filters. The prompt is then processed by a large language model, which may have access to fixed data sources or predefined tools, and finally produces an output.\nThis architecture is entirely reactive. Every response depends solely on the current prompt. There is no memory of past interactions, no planning across steps, and no understanding of goals beyond what the user explicitly provides. The model acts as a sophisticated text processor rather than an autonomous system.\n2. Retrieval Augmented Generation (RAG)\nRetrieval Augmented Generation enhances the basic workflow by grounding the model in external knowledge. When the user submits a prompt, it is converted into embeddings and used to query a vector database that represents documents, knowledge bases, or other structured data sources. The retrieved information is then injected into the prompt as additional context before the model generates a response.\nThis approach allows the system to answer questions using private, up to date, or domain specific data without retraining the model. However, despite being better informed, a RAG system is still reactive. It retrieves information once per request and does not reason across multiple steps or pursue objectives over time.\n3. AI Agents\nAn AI Agent introduces autonomy and internal decision making. Instead of producing a single response, the agent can reason in multiple steps, plan actions, and decide when to use tools or consult data sources. It may maintain short term or long term memory, track conversation history, and evaluate intermediate results before continuing.\nIn this architecture, the language model functions as a planner and controller rather than just a responder. The agent can decompose tasks, execute workflows, and adjust its behavior based on outcomes. While more capable than RAG, an AI Agent typically operates as a single entity with a defined scope and responsibility.\n4. Agentic AI\nAgentic AI represents the highest level of abstraction shown in the diagram. Instead of a single agent, the system consists of multiple specialized agents that collaborate. Each agent may have its own memory, reasoning process, and tool access. Tasks can be delegated between agents, results can be shared, and humans can be included in the loop for oversight or decision approval.\nThis architecture supports complex, long running objectives rather than isolated tasks. The system can adapt to changing conditions, coordinate parallel work, and manage higher level goals. At this stage, intelligence is no longer centralized in one model but distributed across cooperating components."},"Inbox/AI--and--Dev-Tools-Stack":{"slug":"Inbox/AI--and--Dev-Tools-Stack","filePath":"Inbox/AI & Dev Tools Stack.md","title":"AI & Dev Tools Stack","links":[],"tags":["ai"],"content":"A curated list of tools for building websites, web apps, mobile apps, and supporting assets. Grouped by purpose rather than popularity.\nAI Assistants and Coding Help\n\n\nClaude (Anthropic)\nwww.anthropic.com\nClaude Code is particularly useful for reasoning, refactoring, and even non code tasks like organizing files.\n\n\nChatGPT\nchat.openai.com\nUsed for brainstorming, structuring ideas, and occasionally drafting PRDs.\n\n\nApp and Website Builders\n\n\nLovable\nlovable.dev\nRapidly spin up full stack websites and web apps with an integrated backend and AI gateway. Supabase based infrastructure, abstracted.\n\n\nGoogle AI Studio\naistudio.google.com\nIdeal for fast prototypes using Gemini APIs. Publishing and deployment options are still limited.\n\n\nBolt.new\nbolt.new\nSuitable for more complex projects where terminal access is required.\n\n\nYouWare AI\nyouware.ai\nWebsite and web app builder with model selection and integrated backend through YouBase.\n\n\nReplit\nreplit.com\nUseful for mid sized projects that sit between prototyping and production.\n\n\nAnything\nanything.dev\nWebsite, web app, and mobile app builder with backend included and simplified App Store publishing.\n\n\nCursor\ncursor.sh\nAI first code editor that works for almost any type of software project.\n\n\nMobile and Mini App Tools\n\n\nRork\nrork.app\n\n\nVibeCode\nvibecode.app\n\n\nNatively\nnatively.dev\n\n\nWabi\nwabi.app\nFocused on building small, contained mini apps.\n\n\nBackend, Databases, and Infrastructure\n\n\nGitHub\ngithub.com\nVersion control and the central link between code and deployment providers.\n\n\nNetlify\nwww.netlify.com\nDeployment and hosting with seamless GitHub integration and automatic redeploys.\n\n\nConvex\nconvex.dev\nBackend platform with real time data and serverless functions.\n\n\nSupabase\nsupabase.com\nDatabase, authentication, and backend services.\n\n\nDomains, Fonts, and Design Resources\n\n\nNamecheap\nwww.namecheap.com\nDomain registration and management.\n\n\nGoogle Fonts\nfonts.google.com\nFree, high quality web fonts. Always change the default font.\n\n\nCoolors\ncoolors.co\nColor palette generator.\n\n\nMobbin\nmobbin.com\nReal world UI inspiration from production apps.\n\n\nDribbble\ndribbble.com\nConceptual UI and visual design inspiration.\n\n\nAssets and Visuals\n\n\nNanoBanana\nnanobanana.ai\nProfessional assets such as images and icons.\n\n\nCanva\nwww.canva.com\nMagic Erase, background removal, favicon creation, and Open Graph images.\n\n"},"Journal/My-blog's-folder-structure":{"slug":"Journal/My-blog's-folder-structure","filePath":"Journal/My blog's folder structure.md","title":"My blog's folder structure","links":["Inbox","Journal","Notes","Articles","Projects"],"tags":["blog"],"content":"This vault serves two purposes at the same time. It is a personal knowledge base that evolved past Obsidian, and it is also the source for my public blog, which exists thanks to Quartz. Because of that, the folder structure is intentionally simple and based on intent rather than file type or topic. While I have tested many different ways of organizing an Obsidian vault, such as the Johnny Decimal system or the Zettelkasten method, and I have read countless articles about productivity or building a Second Brain, my experience has been that focusing too much on that actually leads to a loss in measurable productivity.\nEach folder represents why a note exists and how it is expected to evolve over time. To aid further organization and ease of finding the notes themselves, appropriate tags are used.\nInbox\nThe Inbox is the default entry point for new notes. Everything starts here.             \r\nWhenever I have a quick thought, an idea, a link, a half formed explanation, or something I do not want to forget, it goes into the Inbox without hesitation. Notes in this folder are allowed to be messy, incomplete, and unstructured. The goal is speed and low friction, not organization. The Inbox is reviewed regularly, and notes are either expanded, rewritten, or moved into one of the other folders once their purpose becomes clear. While the idea is that nothing stays here permanently, it can also be that there can be no other space for a note with the current system. So while the notes are evolving constantly, so is the architecture behind it.\nJournal\nThe Journal contains articles written from my own point of view: personal experiences, reflections, and process oriented writing.\r\nThis includes things like how I solved a specific technical or non technical problem, how I worked through a task at work or during my training, how I am approaching learning a language, or how my thinking changed over time. These notes are written from a first person perspective and focus on the journey rather than polished explanations. I guess you could call this the essence of the blog, as here you would find traditional blog posts .\nNotes\nThe Notes folder is the core, the knowledge base.\r\nIt contains research, explanations, summaries, and distilled information. Each note usually focuses on a single concept, tool, or idea and is written to be clear, concise, and linkable. These notes are not diary like and not necessarily written for publication, but they often support journal entries, articles and projects to grant context. This is where understanding is built and connected.\nArticles\nArticles are standalone pieces of writing intended for readers. These are polished explanations, tutorials, essays, or opinion pieces that are meant to be consumed from start to finish. The tone is more neutral and reader focused than in the Journal, and the structure is deliberate.\nProjects\nThe Projects folder contains documentation related to concrete projects. This includes project overviews, goals, requirements, decisions, architecture notes, implementation details, and post project reflections. Unlike Journal entries, these notes are scoped to a specific project and focus on what was built and why certain decisions were made. Projects often link out to Notes for technical concepts and may also reference Articles or Journal entries for deeper context."},"Journal/Research-for-a-diagonally-mounted-projector":{"slug":"Journal/Research-for-a-diagonally-mounted-projector","filePath":"Journal/Research for a diagonally-mounted projector.md","title":"Research for a diagonally-mounted projector","links":["Notes/Projectors/Projector-light-sources","Notes/Projectors/Keystone-correction","Notes/Projectors/Lens-shift-function","Notes/Projectors/Throw-correction"],"tags":["projector"],"content":"\n\n                  \n                  Scenario description \n                  \n                \n\nA projector is required for a gate corridor, which will be used to project symbols like arrows or brand images/logos on the floor. As it will be held on the ceiling and reflect diagonally, active 24/7 and will have to be bright enough to project clearly during daylight, there is a lot of specific criteria there is to be kept in mind.\r\n\n\n\nThe projector would be mounted on the ceiling at a height of roughly ten meters, projecting diagonally onto the floor. It would run continuously, day and night, and still had to produce a clear, readable image even in broad daylight.\nI started by identifying the non negotiable requirements. The throw ratio of around ten meters immediately ruled out many consumer grade devices. In addition, the angled projection meant that image alignment would be an issue if the projector did not support proper optical correction. Since the device would be mounted high above the floor, remote control was mandatory, both for setup and for ongoing adjustments.\nBrightness was one of the most important factors, so I focused first on understanding ANSI lumens in real world conditions. I researched how ambient light affects projected images and found that typical recommendations for indoor projectors are completely insufficient in environments with strong daylight. Based on multiple sources, I concluded that for broad daylight scenarios, especially when projecting onto the floor instead of a dedicated screen, a brightness range of roughly six thousand to ten thousand ANSI lumens is required to maintain clarity and contrast.\nNext, I looked into different light source technologies. Traditional lamp based projectors were quickly ruled out due to their shorter lifespan and higher maintenance needs. LED options did not offer enough brightness for this use case. Laser based projectors stood out as the most suitable choice because they offer high brightness, consistent color quality, and significantly longer lifetimes.\nAfter that, I revisited projection geometry. Keystone correction initially seemed relevant, but further research showed that it is a digital correction method that reduces image quality. Since image sharpness was important and the budget already implied professional grade hardware, I focused instead on lens shift. Lens shift allows optical adjustment without image loss and is therefore far superior for permanent installations. Given the mounting height, motorised lens shift was required, both vertically and horizontally, to allow precise alignment without physical access.\nThrow ratio and throw correction were less of a concern once I narrowed the search to high end projectors, as these features are typically included in this category anyway.\nAfter filtering all available options using these criteria, the Optoma ZU820T emerged as the best fit. It provides WUXGA resolution, sufficient brightness for daylight projection, a laser light source, motorised lens shift, and remote control functionality. It meets all functional and environmental requirements of the corridor scenario.\nTo complete the setup, I also identified a suitable ceiling mount, the Optoma OCMPROSR70 Pro AV ceiling mount in the short variant, which supports secure overhead installation.\nOverall, the research process reinforced how important it is to fully understand the physical environment and usage conditions before selecting hardware. Brightness ratings, correction features, and light source technology all mattered far more than brand or headline specifications, and approaching the task methodically made the final decision straightforward."},"Journal/Roadmap-for-learning-the-Hungarian-language":{"slug":"Journal/Roadmap-for-learning-the-Hungarian-language","filePath":"Journal/Roadmap for learning the Hungarian language.md","title":"Roadmap for learning the Hungarian language","links":[],"tags":["language","roadmap","hungarian"],"content":"As some of you might know, my girlfriend is Hungarian. As a pet project of mine, I wish to learn Hungarian in order to not only learn more about the culture of my loved one, but also to conversate with her family more easily. Also, it will help me when I go visit Budapest again.\nLearning a language unfortunately is not that easy though. In my opinion, apps like Duolingo don’t really help as much as they’re advertised to. For this reason, we are going to take a slightly different approach. While I learned English and German simply by being exposed to the languages, and Italian because it is my native tongue, for Hungarian we will use multiple tools.\nFirst, research has pointed me to many different resources.\nResources\n\nHungarian Alphabet with Pronunciation\nVideos for Consonants, Vowels and Spelling Rules\nHungarian Numbers\n\nThese will be the three primary initial resources we will use in order to build strong fundamentals. They are all taken from this article on how to learn Hungarian.\nWe will combine videos with any AI capable of watching them in order to transcribe everything that has been said.\nOur primary AI used will be ChatGPT, with the creation of a Project just for learning Hungarian.\nIn order to properly understand the pronunciation of the words, the LLM will be used in order to write a phonetical spelling as it would be said in Italian.\nRoadmap, Step by Step\n\nHungarian Alphabet and Pronunciation\nUnderstand Agglutination, the Nature of the Language\nUnderstand the Hungarian Word Order\nNumbers\nCommon Vocabulary\nImmerse Yourself\n\n\nWIP -\n"},"Notes/Atomic-Design":{"slug":"Notes/Atomic-Design","filePath":"Notes/Atomic Design.md","title":"Atomic design","links":[],"tags":["ui-design"],"content":"Atomic design is a methodology composed of five distinct stages working together to create interface design systems in a more deliberate and hierarchical manner.\nThe five stages of atomic design are:\n\nAtoms\nMolecules\nOrganisms\nTemplates\nPages\n\nAtomic design is not a linear process, but rather a mental model to help us think of our user interfaces as both a cohesive whole and a collection of parts at the same time. Each of the five stages plays a key role in the hierarchy of our interface design systems.\nAtoms\nIf atoms are the basic building blocks of matter, then the atoms of our interfaces serve as the foundational building blocks that comprise all our user interfaces.\nThese atoms include basic HTML elements like form labels, inputs, buttons, and others that can’t be broken down any further without ceasing to be functional.\nMolecules\nIn interfaces, molecules are relatively simple groups of UI elements functioning together as a unit. For example, a form label, search input, and button can join together to create a search form molecule.\nOrganisms\nOrganisms are relatively complex UI components composed of groups of molecules and/or atoms and/or other organisms. These organisms form distinct sections of an interface.\nThis header organism is composed of a search form molecule, logo atom, and primary navigation molecule.\nTemplates\nTemplates are page-level objects that place components into a layout and articulate the design’s underlying content structure. To build on our previous example, we can take the header organism and apply it to a homepage template.\nAnother important characteristic of templates is that they focus on the page’s underlying content structure rather than the page’s final content. Design systems must account for the dynamic nature of content, so it’s very helpful to articulate important properties of components like image sizes and character lengths for headings and text passages.\nPages\nPages are specific instances of templates that show what a UI looks like with real representative content in place. Building on our previous example, we can take the homepage template and pour representative text, images, and media into the template to show real content in action.\nThe page stage replaces placeholder content with real representative content to bring the design system to life.\nIn addition to demonstrating the final interface as your users will see it, pages are essential for testing the effectiveness of the underlying design system. It is at the page stage that we’re able to take a look at how all those patterns hold up when real content is applied to the design system.\nPages also provide a place to articulate variations in templates, which is crucial for establishing robust and reliant design systems.\nTL;DR:\n\nAtoms are UI elements that can’t be broken down any further and serve as the elemental building blocks of an interface.\nMolecules are collections of atoms that form relatively simple UI components.\nOrganisms are relatively complex components that form discrete sections of an interface.\nTemplates place components within a layout and demonstrate the design’s underlying content structure.\nPages apply real content to templates and articulate variations to demonstrate the final UI and test the resilience of the design system.\n"},"Notes/Projectors/Keystone-correction":{"slug":"Notes/Projectors/Keystone-correction","filePath":"Notes/Projectors/Keystone correction.md","title":"Keystone correction","links":["Notes/Projectors/Lens-shift-function"],"tags":["projector"],"content":"When a projector is placed at an angle to the screen, the projected image becomes distorted into a trapezoid shape instead of a rectangle.\nThis distortion is called keystone effect.\nKeystone correction is the method of adjusting the image so it appears rectangular again.\nThere are several types of keystone correction.\nTypes of Keystone Correction\nVertical Keystone\nVertical keystone correction fixes distortion when the projector is too high (ceiling mounted) or too low (table placement) relative to the screen.\nHorizontal Keystone\nHorizontal keystone correction fixes distortion when the projector is placed to the left or right of the screen’s center.\n4-Point (Corner) Keystone\n4-point keystone allows adjustment of each corner of the image independently. This makes it possible to correct both vertical and horizontal distortions at once and adapt to uneven projection surfaces.\nAuto Keystone\nAuto keystone uses sensors to detect the angle of the projector and automatically corrects the distortion.\nLens Shift (Optical Alternative)\nLens shift is not digital correction but a mechanical adjustment that moves the lens up/down or left/right to align the image.\nBecause it is optical, there is no scaling and no loss in image quality. It is available mainly in higher-end projectors."},"Notes/Projectors/Lens-shift-function":{"slug":"Notes/Projectors/Lens-shift-function","filePath":"Notes/Projectors/Lens-shift function.md","title":"Lens-shift function","links":["Notes/Projectors/Keystone-correction"],"tags":["projector"],"content":"Lens shift is a mechanical adjustment in a projector that moves the lens inside the projector housing. By shifting the lens up, down, left, or right, the image position on the screen can be changed without tilting the projector and without introducing trapezoid distortion.\nUnlike digital keystone correction, lens shift preserves the full resolution and image quality because no digital scaling is applied.\nTypes of Lens Shift\nVertical Lens Shift\nVertical lens shift moves the image up or down on the screen.\nHorizontal Lens Shift\nHorizontal lens shift moves the image left or right. Usually offers a smaller adjustment range than vertical shift.\nCombined (Vertical + Horizontal)\nSome projectors provide both vertical and horizontal lens shift. This combination gives maximum flexibility, allowing placement above, below, or to the side of screen center without compromising image quality."},"Notes/Projectors/Projector-light-sources":{"slug":"Notes/Projectors/Projector-light-sources","filePath":"Notes/Projectors/Projector light sources.md","title":"Projector light sources","links":[],"tags":["projector"],"content":"Projector light sources fall into two broad families: traditional lamp-based sources and solid-state sources.\nLamp-based sources use a replaceable bulb that produces light through electric discharge in a gas and metal salts.\nSolid-state sources use semiconductor devices such as LEDs or lasers to create light without a conventional bulb.\nTypes of light sources\nLamp-based\nLamp-based projectors typically require a warm-up period to reach stable brightness and they lose brightness gradually as the lamp ages. Lamps have a limited rated life, often between 2,000 and 5,000 hours in average consumer and business models, and sometimes more with eco modes. Lamp replacement is a recurring maintenance cost and proper disposal is necessary because some lamps contain mercury or other hazardous materials.\nLamp-based systems are the oldest and were the standard for many years. The common variants are Ultra High Performance (UHP) lamps, metal halide, and xenon arc lamps.\nUHP and metal halide lamps deliver high peak brightness and have been widely used in consumer, education, and business projectors.\nXenon arc lamps, which are rarer in small projectors, have been common in cinema projectors and in specialized high-color-accuracy applications.\nLED\nLED projectors use arrays of high-power LEDs as the light source. LEDs provide very long operating life compared to lamps and maintain color stability over time. They reach usable brightness instantly and support instant on/off operation without warm-up. LED-based projectors are compact and energy efficient, and they produce less heat.\nThe main limitation for LED projectors has historically been maximum brightness. Consumer and portable LED projectors are excellent for small- to medium-size screens and for dark to moderately lit rooms, but they struggle in very bright environments unless paired with a smaller screen or very close throw distances. LEDs typically advertise lifespans in the tens of thousands of hours, commonly 20,000 to 30,000 hours for many models.\nLaser\nLaser sources are solid-state, with long rated lifetimes often quoted in the tens of thousands of hours, and they provide near-instant on/off capability, minimal drift in color and brightness, and lower maintenance because there is no replaceable bulb. Lasers can achieve much higher lumen outputs than LED, making them ideal for bright-room and large-screen applications.\nLaser projectors come in multiple flavors:\nDirect RGB laser\nRGB laser projectors use separate red, green, and blue laser emitters to generate light directly. These systems offer the best color gamut and can reach very high brightness.\nBlue laser with phosphor\nBlue-laser plus phosphor systems use blue lasers to excite a phosphor wheel that emits yellow light which, combined with the remaining blue, creates full-color images. This approach scales well to very high brightness levels and is common in large venue and cinema-class projectors.\nLaser-phosphor\nLaser-phosphor is technically a hybrid in the sense that a laser pumps a phosphor to create broad-spectrum white light that is then used by the projector engine."},"Notes/Projectors/Throw-correction":{"slug":"Notes/Projectors/Throw-correction","filePath":"Notes/Projectors/Throw correction.md","title":"Throw correction","links":[],"tags":["projector"],"content":"Throw correction refers to a projector’s ability to adjust the image size and placement relative to the distance between the projector and the screen, without having to physically move the projector.\nIt is closely related to the concept of throw ratio, which defines how wide the image will be at a given distance.\nThrow correction is usually achieved with a zoom lens or variable optics that allow users to fine-tune the image size. Some projectors are designed with short throw or ultra-short throw lenses to project large images from very close distances.\nThe flexibility of throw correction directly affects installation options in different environments.\nTypes of Throw Correction\nOptical Zoom (Variable Throw)\nAn optical zoom lens allows the image size to be increased or decreased by adjusting the lens, without moving the projector. The zoom range is expressed as a ratio (e.g. 1.2x, 1.6x).\nFixed Throw (No Zoom)\nSome projectors, especially budget models and portable units, have a fixed throw ratio with no zoom adjustment. The only way to change image size is by moving the projector closer or farther from the screen.\nShort Throw\nShort throw projectors have specially designed lenses that project large images from a short distance (e.g. 100-inch image from 1–2 meters).\nUltra-Short Throw (UST)\nUltra-short throw projectors can sit just a few centimeters from the wall or screen and still project very large images."},"Notes/Screaming-Architecture":{"slug":"Notes/Screaming-Architecture","filePath":"Notes/Screaming Architecture.md","title":"Screaming Architecture","links":[],"tags":["system-design","software-architecture"],"content":"Screaming Architecture is a concept introduced by renowned software developer and thought leader Robert C. Martin, often referred to as “Uncle Bob”.\nAs the name suggests, it is a principle in software design focusing on making the features of your system the primary concern of your architecture. Your software architecture should “scream” its intent and purpose.\nWhy “Screaming” Architecture?\nThe idea is that the structure of your codebase should immediately convey its business purpose. This goes against traditional architectures, as they emphasize the technical aspect of it. Uncle Bob illustrated this with an analogy: if you walk up to a building and see its architecture, you can often tell whether it is a library, school or office instantly. The same should apply to your architecture.\nBusiness &amp; Domain Logic\nIn many projects, the file structures can be like this:\ncontrollers/\r\nservices/\r\nrepositories/\r\nmodels/\n\nThis structure describes technical roles and tells you that the system uses MVC (Model-View-Controller), but it doesn’t tell you how it handles financial data, user management or content creation.\nHere is an example of a structure that “screams” its intent using domain-driven principles:\n/src\r\n    /accounting\r\n        Ledger.cs\r\n        Transaction.cs\r\n        Account.cs\r\n        TaxService.cs\r\n    /sales\r\n        Order.cs\r\n        Invoice.cs\r\n        Customer.cs\r\n        DiscountPolicy.cs\n\nor:\n/src\r\n    /orders\r\n        OrderController.cs\r\n        OrderService.cs\r\n        OrderRepository.cs\r\n        Order.cs\r\n        OrderItem.cs\r\n    /inventory\r\n        InventoryController.cs\r\n        InventoryService.cs\r\n        InventoryRepository.cs\r\n        InventoryItem.cs\n"},"index":{"slug":"index","filePath":"index.md","title":"Dinonomicon","links":[],"tags":[],"content":"Welcome to Dinonomicon.\nThis is a placeholder home page. You can customize it later."}}