{"Gaming/Final-Fantasy/Flares-and-Bahamut's-Pinnacle":{"slug":"Gaming/Final-Fantasy/Flares-and-Bahamut's-Pinnacle","filePath":"Gaming/Final Fantasy/Flares and Bahamut's Pinnacle.md","title":"Flares and Bahamut's Pinnacle","links":[],"tags":["gaming","final-fantasy","article"],"content":"\n\n                  \n                  Zettaflare \n                  \n                \n\nThe strongest Bahamut… no, Final Fantasy spell? Let’s venture into the different versions of Flare throughout Final Fantasy history and the franchise.\n\n\nNanoflare\n\nnano - 10-9 - 0.000000001\n\n\nNanoflare, used by Ultima Demon in Final Fantasy Tactics. Perhaps a weaker version of Flare.\n\nmicro - 10-6 - 0.000001\nmilli - 10-3 - 0.001\ncenti - 10-2 - 0.01\ndeci - 10-1 - 0.1\n\nFlare\n\nFlare, also known as Nuke, is considered an ultimate spell in some of the games (along with Holy, Meteor and Ultima). It can be a non-elemental Black Magic or the final form of the Fire magic.\n\ndeca – 101 – 10\nkilo – 103 – 1,000\nmega – 106 – 1,000,000\n\nMegaflare\n\nMegaflare, performed by Bahamut in Final Fantasy XIII. Also known as Mega Flare, Sun Flare and MegaNuke, and it is usually used by Bahamut - sometimes other versions of it, with different prefixes (Dark Flare by Tiamat).\n\ngiga – 109 – 1,000,000,000\n\nGigaflare\n\nGigaflare is an upgraded form of Megaflare and just like it, is most often used by Bahamut or very strong bosses.\n\ntera – 1012 – 1,000,000,000,000\n\nTeraflare\n\nTeraflare, also spelled Tera Flare, is an upgraded form of Megaflare even stronger than Gigaflare, and it does colossal non-elemental damage to all targets. It is universally exclusive to Bahamut and incarnations of his, and was the spell used in the ending of FF XIV.\n\npeta – 1015 – 1,000,000,000,000,000\nexa – 1018 – 1,000,000,000,000,000,000\n\nExaflare\n\nExaflare is an ability associated with variants of Bahamut, but not Bahamut himself. Based on the spell’s name etymology, one can expect it to be stronger than Teraflare.\n\nzetta -1021 – 1,000,000,000,000,000,000,000\n\nZettaflare\n\nZettaflare stands at the pinnacle of abilities not only in Final Fantasy, but the entire Square Enix multiverse.\nLet us put this into perspective. “Teraflare” is what Bahamut used to wipe out the original FF14 universe and “Zettaflare” trascends that benchmark by two tiers.\nAn actual canon estimation of the strength of this spell is one QUADRILLION times “Teraflare”‘s power.\nThis is the most destructive spell in the franchise, capable of wiping out entire universes.\nIt is so powerful that it cannot be used under normal circumstances and prior to this game (Final Fantasy XVI), there have only ever been two characters in all of Square Enix who were able to cast it, making it extremely limited.\nThe first one was Airy from Bravely Default who could only use it after being powered up by an Eldritch God who, at that point, had already devoured several thousand alternate universes to obtain that level of power.\nThe second was Donald Duck from Kingdom Hearts 3, making Bahamut the official third.\nHere in Bahamut’s case, he used it only after absorbing a crystal that has been storing several thousand years worth of aether in it. Donald is the only exception to the special circumstances requisite.\nThe spell has existed in the the series for a while now but was treated like an myth, something nobody thought possible to achieve until now. The fact that this is the first time it’s been ever been used in Final Fantasy is outstanding."},"Gaming/TFT/Set-16/Comp-Compendium":{"slug":"Gaming/TFT/Set-16/Comp-Compendium","filePath":"Gaming/TFT/Set 16/Comp Compendium.md","title":"Comp Compendium","links":[],"tags":["gaming","tft"],"content":"\n\n                  \n                   Set 16 Flex Guide by CHRISTOPHO\n                  \n                \n\nContains:\nTempo Lvl 8 / 9\n\n Yunara Freljord\n Ionia XP / Gold\n Void\n Diana\n T-Hex\n Lissandra / Voli\n Bilgewater\n\nReroll\n\n Tryndamere / Ashe\n Yasuo / Yone\n Illaoi Hero Augment\n\n\n\n\n\n                  \n                   Set 16 T-Hex Piltover Guide by asholley1015\n                  \n                \n\n\n\n                  \n                   Set 16 Rek’Sai Reroll Guide by G_Ree\n                  \n                \n"},"Gaming/TFT/Set-16/TFT-Set-16---Bard-meta":{"slug":"Gaming/TFT/Set-16/TFT-Set-16---Bard-meta","filePath":"Gaming/TFT/Set 16/TFT Set 16 - Bard meta.md","title":"TFT Set 16 - Bard meta","links":[],"tags":["gaming","tft"],"content":" Bard’s Caretaker trait is very powerful.\n\n\n                  \n                  Caretaker \n                  \n                \n\nAfter winning player combat, gain a random unit from Runeterra. After losing combat, gain free rerolls, with the amount increasing by stage.\n\n\nTake an Economy augment and roll for Bard more than 80% of your games.\nWhy? The rerolls on losses more than make up for the early economy you lose, especially in stage 4. Greed and stack Bard rolls until you finish your level 8 or are at 2 lives remaining.\nWorks in every comp, but here are some specific examples below.\nCaitlyn 3 T-Hex\nBard often summons a Caitlyn when you win and rolls help you star up units to unlock T-Hex.\r\nGreed Bard until 2 lives and swap out him and 6 Piltover for legendaries.\n\nDraven Skarner fast 9\nUse free Bard rolls to hit Draven 2 on 3-5 level 7 and greed Bard further to hit 4 cost upgrades and go 9 and swap to Kindred carry.\n\nDiana Shurima\nUse bard rolls to hit Leona 2 and then greed him and stack rolls in stage 4 to complete board.\n\n\nYou seriously can play him towards any comp with an econ augment or high econ start.\nThe units you roll for on stage 2 with bard is usually Econ Ionia, 3 Ixtal, 3 Bilgewater, or tempo.\nIf low hp roll on 3-5, if high HP can roll lvl 8.\n\nCredits to AesahTFT’s post."},"Gaming/TFT/Set-16/TFT-Set-16---Swain-Positioning":{"slug":"Gaming/TFT/Set-16/TFT-Set-16---Swain-Positioning","filePath":"Gaming/TFT/Set 16/TFT Set 16 - Swain Positioning.md","title":"TFT Set 16 - Swain Positioning","links":[],"tags":["gaming","tft"],"content":" Swain is one of the most splashable units of this set, be it for his traits (Arcanist giving AP to the entire board, Juggernaut makes him more reliably durable and Noxus can be a good addition, especially with Bronze for Life) or for his AoE CC.\nLet us look at his ability: he summons his eye within 2 hexes. The eye is the center of the stun and targets the largest clump of champions in a 3 hex radius.\nPlaying Swain\nSwain can be defaulted in the middle as he can reach both corners, rendering it an easy way to catch opponents who have not prepared against it.\nPlaying against Swain\nIf the enemy has prepared for it, they can avoid Swain’s stun no matter what. Against Swain, all you have to do is make sure your ranged carry is not in the largest clump of champions on the board.\n\n\nCredits to AesahTFT’s post."},"Notes/From-LLMs-to-Agentic-AI":{"slug":"Notes/From-LLMs-to-Agentic-AI","filePath":"Notes/From LLMs to Agentic AI.md","title":"From LLMs to Agentic AI","links":[],"tags":["ai","research"],"content":"This entry breaks down the architectural evolution of modern AI systems as shown in the diagram, moving from simple Large Language Model workflows to fully agentic, multi agent systems.\n\nPicture from “Agentic Design Patterns: A Hands-On Guide to Building Intelligent Systems by Antonio Gulli”\n1. Basic LLM Workflow\nThe most fundamental setup is the classic LLM workflow. A user provides a prompt, which may optionally pass through simple rule based triggers such as formatting checks, routing logic, or safety filters. The prompt is then processed by a large language model, which may have access to fixed data sources or predefined tools, and finally produces an output.\nThis architecture is entirely reactive. Every response depends solely on the current prompt. There is no memory of past interactions, no planning across steps, and no understanding of goals beyond what the user explicitly provides. The model acts as a sophisticated text processor rather than an autonomous system.\n2. Retrieval Augmented Generation (RAG)\nRetrieval Augmented Generation enhances the basic workflow by grounding the model in external knowledge. When the user submits a prompt, it is converted into embeddings and used to query a vector database that represents documents, knowledge bases, or other structured data sources. The retrieved information is then injected into the prompt as additional context before the model generates a response.\nThis approach allows the system to answer questions using private, up to date, or domain specific data without retraining the model. However, despite being better informed, a RAG system is still reactive. It retrieves information once per request and does not reason across multiple steps or pursue objectives over time.\n3. AI Agents\nAn AI Agent introduces autonomy and internal decision making. Instead of producing a single response, the agent can reason in multiple steps, plan actions, and decide when to use tools or consult data sources. It may maintain short term or long term memory, track conversation history, and evaluate intermediate results before continuing.\nIn this architecture, the language model functions as a planner and controller rather than just a responder. The agent can decompose tasks, execute workflows, and adjust its behavior based on outcomes. While more capable than RAG, an AI Agent typically operates as a single entity with a defined scope and responsibility.\n4. Agentic AI\nAgentic AI represents the highest level of abstraction shown in the diagram. Instead of a single agent, the system consists of multiple specialized agents that collaborate. Each agent may have its own memory, reasoning process, and tool access. Tasks can be delegated between agents, results can be shared, and humans can be included in the loop for oversight or decision approval.\nThis architecture supports complex, long running objectives rather than isolated tasks. The system can adapt to changing conditions, coordinate parallel work, and manage higher level goals. At this stage, intelligence is no longer centralized in one model but distributed across cooperating components."},"Notes/Projectors/Keystone-Correction":{"slug":"Notes/Projectors/Keystone-Correction","filePath":"Notes/Projectors/Keystone Correction.md","title":"Keystone correction","links":["Notes/Projectors/Lens-shift-function"],"tags":["projector","research"],"content":"When a projector is placed at an angle to the screen, the projected image becomes distorted into a trapezoid shape instead of a rectangle.\nThis distortion is called keystone effect.\nKeystone correction is the method of adjusting the image so it appears rectangular again.\nThere are several types of keystone correction.\nTypes of Keystone Correction\nVertical Keystone\nVertical keystone correction fixes distortion when the projector is too high (ceiling mounted) or too low (table placement) relative to the screen.\nHorizontal Keystone\nHorizontal keystone correction fixes distortion when the projector is placed to the left or right of the screen’s center.\n4-Point (Corner) Keystone\n4-point keystone allows adjustment of each corner of the image independently. This makes it possible to correct both vertical and horizontal distortions at once and adapt to uneven projection surfaces.\nAuto Keystone\nAuto keystone uses sensors to detect the angle of the projector and automatically corrects the distortion.\nLens Shift (Optical Alternative)\nLens shift is not digital correction but a mechanical adjustment that moves the lens up/down or left/right to align the image.\nBecause it is optical, there is no scaling and no loss in image quality. It is available mainly in higher-end projectors."},"Notes/Projectors/Lens-shift-function":{"slug":"Notes/Projectors/Lens-shift-function","filePath":"Notes/Projectors/Lens-shift function.md","title":"Lens-shift function","links":["Keystone-correction"],"tags":["projector","research"],"content":"Lens shift is a mechanical adjustment in a projector that moves the lens inside the projector housing. By shifting the lens up, down, left, or right, the image position on the screen can be changed without tilting the projector and without introducing trapezoid distortion.\nUnlike digital keystone correction, lens shift preserves the full resolution and image quality because no digital scaling is applied.\nTypes of Lens Shift\nVertical Lens Shift\nVertical lens shift moves the image up or down on the screen.\nHorizontal Lens Shift\nHorizontal lens shift moves the image left or right. Usually offers a smaller adjustment range than vertical shift.\nCombined (Vertical + Horizontal)\nSome projectors provide both vertical and horizontal lens shift. This combination gives maximum flexibility, allowing placement above, below, or to the side of screen center without compromising image quality."},"Notes/Projectors/Projector-light-sources":{"slug":"Notes/Projectors/Projector-light-sources","filePath":"Notes/Projectors/Projector light sources.md","title":"Projector light sources","links":[],"tags":["projector","research"],"content":"Projector light sources fall into two broad families: traditional lamp-based sources and solid-state sources.\nLamp-based sources use a replaceable bulb that produces light through electric discharge in a gas and metal salts.\nSolid-state sources use semiconductor devices such as LEDs or lasers to create light without a conventional bulb.\nTypes of light sources\nLamp-based\nLamp-based projectors typically require a warm-up period to reach stable brightness and they lose brightness gradually as the lamp ages. Lamps have a limited rated life, often between 2,000 and 5,000 hours in average consumer and business models, and sometimes more with eco modes. Lamp replacement is a recurring maintenance cost and proper disposal is necessary because some lamps contain mercury or other hazardous materials.\nLamp-based systems are the oldest and were the standard for many years. The common variants are Ultra High Performance (UHP) lamps, metal halide, and xenon arc lamps.\nUHP and metal halide lamps deliver high peak brightness and have been widely used in consumer, education, and business projectors.\nXenon arc lamps, which are rarer in small projectors, have been common in cinema projectors and in specialized high-color-accuracy applications.\nLED\nLED projectors use arrays of high-power LEDs as the light source. LEDs provide very long operating life compared to lamps and maintain color stability over time. They reach usable brightness instantly and support instant on/off operation without warm-up. LED-based projectors are compact and energy efficient, and they produce less heat.\nThe main limitation for LED projectors has historically been maximum brightness. Consumer and portable LED projectors are excellent for small- to medium-size screens and for dark to moderately lit rooms, but they struggle in very bright environments unless paired with a smaller screen or very close throw distances. LEDs typically advertise lifespans in the tens of thousands of hours, commonly 20,000 to 30,000 hours for many models.\nLaser\nLaser sources are solid-state, with long rated lifetimes often quoted in the tens of thousands of hours, and they provide near-instant on/off capability, minimal drift in color and brightness, and lower maintenance because there is no replaceable bulb. Lasers can achieve much higher lumen outputs than LED, making them ideal for bright-room and large-screen applications.\nLaser projectors come in multiple flavors:\nDirect RGB laser\nRGB laser projectors use separate red, green, and blue laser emitters to generate light directly. These systems offer the best color gamut and can reach very high brightness.\nBlue laser with phosphor\nBlue-laser plus phosphor systems use blue lasers to excite a phosphor wheel that emits yellow light which, combined with the remaining blue, creates full-color images. This approach scales well to very high brightness levels and is common in large venue and cinema-class projectors.\nLaser-phosphor\nLaser-phosphor is technically a hybrid in the sense that a laser pumps a phosphor to create broad-spectrum white light that is then used by the projector engine."},"Notes/Projectors/Throw-correction":{"slug":"Notes/Projectors/Throw-correction","filePath":"Notes/Projectors/Throw correction.md","title":"Throw correction","links":[],"tags":["projector","research"],"content":"Throw correction refers to a projector’s ability to adjust the image size and placement relative to the distance between the projector and the screen, without having to physically move the projector.\nIt is closely related to the concept of throw ratio, which defines how wide the image will be at a given distance.\nThrow correction is usually achieved with a zoom lens or variable optics that allow users to fine-tune the image size. Some projectors are designed with short throw or ultra-short throw lenses to project large images from very close distances.\nThe flexibility of throw correction directly affects installation options in different environments.\nTypes of Throw Correction\nOptical Zoom (Variable Throw)\nAn optical zoom lens allows the image size to be increased or decreased by adjusting the lens, without moving the projector. The zoom range is expressed as a ratio (e.g. 1.2x, 1.6x).\nFixed Throw (No Zoom)\nSome projectors, especially budget models and portable units, have a fixed throw ratio with no zoom adjustment. The only way to change image size is by moving the projector closer or farther from the screen.\nShort Throw\nShort throw projectors have specially designed lenses that project large images from a short distance (e.g. 100-inch image from 1–2 meters).\nUltra-Short Throw (UST)\nUltra-short throw projectors can sit just a few centimeters from the wall or screen and still project very large images."},"Recipes/Ragù-alla-bolognese":{"slug":"Recipes/Ragù-alla-bolognese","filePath":"Recipes/Ragù alla bolognese.md","title":"Ragù alla bolognese","links":[],"tags":["recipe"],"content":"One of the simplest, most flavourful ragù you can make.\nPreferred pasta to use is tagliatelle, but spaghetti is what made it so commonly known internationally.\nRecipe\n\n\n                  \n                  Ingredients \n                  \n                \n\n\nOlive oil\n150g of bacon\n300g of minced beef\n300g of passata di pomodoro\nCelery\nOnion\nCarrot\nRed wine\n1l vegetable broth\nOptional: Dark chocolate\n\n\n\nPour olive oil in a big pot on high heat. Drop the cubed bacon in, after a few minutes drop the chopped celery, onion and carrot in and let it brown. After a few minutes again, drop the minced beef.\nScorch, then deglaze using wine.\nThe color of the ragù should be brown, not red.\nAfter that, pour all of the passata di pomodoro and start cooking for 2 hours on low-medium heat, while constantly checking how much liquid is inside and refilling with a ladle of vegetable broth around every 20 minutes.\nYou can optionally add dark chocolate to make the flavour profile richer and add a slight bit of creaminess.\nWhen sauce has thickened, taste: if necessary, add a glass of milk, then salt and pepper."},"Roadmap-for-learning-the-Hungarian-language":{"slug":"Roadmap-for-learning-the-Hungarian-language","filePath":"Roadmap for learning the Hungarian language.md","title":"Roadmap for learning the Hungarian language","links":[],"tags":["language","roadmap","hungarian"],"content":"As some of you might know, my girlfriend is Hungarian. As a pet project of mine, I wish to learn Hungarian in order to not only learn more about the culture of my loved one, but also to conversate with her family more easily. Also, it will help me when I go visit Budapest again.\nLearning a language unfortunately is not that easy though. In my opinion, apps like Duolingo don’t really help as much as they’re advertised to. For this reason, we are going to take a slightly different approach. While I learned English and German simply by being exposed to the languages, and Italian because it is my native tongue, for Hungarian we will use multiple tools.\nFirst, research has pointed me to many different resources.\nResources\n\nHungarian Alphabet with Pronunciation\nVideos for Consonants, Vowels and Spelling Rules\nHungarian Numbers\n\nThese will be the three primary initial resources we will use in order to build strong fundamentals. They are all taken from this article on how to learn Hungarian.\nWe will combine videos with any AI capable of watching them in order to transcribe everything that has been said.\nOur primary AI used will be ChatGPT, with the creation of a Project just for learning Hungarian.\nIn order to properly understand the pronunciation of the words, the LLM will be used in order to write a phonetical spelling as it would be said in Italian.\nRoadmap, Step by Step\n\nHungarian Alphabet and Pronunciation\nUnderstand Agglutination, the Nature of the Language\nUnderstand the Hungarian Word Order\nNumbers\nCommon Vocabulary\nImmerse Yourself\n\n\nWIP -\n"},"Software/Atomic-Design":{"slug":"Software/Atomic-Design","filePath":"Software/Atomic Design.md","title":"Atomic design","links":[],"tags":["software-development","design","ui-ux"],"content":"Atomic design is a methodology composed of five distinct stages working together to create interface design systems in a more deliberate and hierarchical manner.\nThe five stages of atomic design are:\n\nAtoms\nMolecules\nOrganisms\nTemplates\nPages\n\nAtomic design is not a linear process, but rather a mental model to help us think of our user interfaces as both a cohesive whole and a collection of parts at the same time. Each of the five stages plays a key role in the hierarchy of our interface design systems.\nAtoms\nIf atoms are the basic building blocks of matter, then the atoms of our interfaces serve as the foundational building blocks that comprise all our user interfaces.\nThese atoms include basic HTML elements like form labels, inputs, buttons, and others that can’t be broken down any further without ceasing to be functional.\nMolecules\nIn interfaces, molecules are relatively simple groups of UI elements functioning together as a unit. For example, a form label, search input, and button can join together to create a search form molecule.\nOrganisms\nOrganisms are relatively complex UI components composed of groups of molecules and/or atoms and/or other organisms. These organisms form distinct sections of an interface.\nThis header organism is composed of a search form molecule, logo atom, and primary navigation molecule.\nTemplates\nTemplates are page-level objects that place components into a layout and articulate the design’s underlying content structure. To build on our previous example, we can take the header organism and apply it to a homepage template.\nAnother important characteristic of templates is that they focus on the page’s underlying content structure rather than the page’s final content. Design systems must account for the dynamic nature of content, so it’s very helpful to articulate important properties of components like image sizes and character lengths for headings and text passages.\nPages\nPages are specific instances of templates that show what a UI looks like with real representative content in place. Building on our previous example, we can take the homepage template and pour representative text, images, and media into the template to show real content in action.\nThe page stage replaces placeholder content with real representative content to bring the design system to life.\nIn addition to demonstrating the final interface as your users will see it, pages are essential for testing the effectiveness of the underlying design system. It is at the page stage that we’re able to take a look at how all those patterns hold up when real content is applied to the design system.\nPages also provide a place to articulate variations in templates, which is crucial for establishing robust and reliant design systems.\nTL;DR:\n\nAtoms are UI elements that can’t be broken down any further and serve as the elemental building blocks of an interface.\nMolecules are collections of atoms that form relatively simple UI components.\nOrganisms are relatively complex components that form discrete sections of an interface.\nTemplates place components within a layout and demonstrate the design’s underlying content structure.\nPages apply real content to templates and articulate variations to demonstrate the final UI and test the resilience of the design system.\n"},"Software/Screaming-Architecture":{"slug":"Software/Screaming-Architecture","filePath":"Software/Screaming Architecture.md","title":"Screaming Architecture","links":[],"tags":["software-development","design","architecture"],"content":"Screaming Architecture is a concept introduced by renowned software developer and thought leader Robert C. Martin, often referred to as “Uncle Bob”.\nAs the name suggests, it is a principle in software design focusing on making the features of your system the primary concern of your architecture. Your software architecture should “scream” its intent and purpose.\nWhy “Screaming” Architecture?\nThe idea is that the structure of your codebase should immediately convey its business purpose. This goes against traditional architectures, as they emphasize the technical aspect of it. Uncle Bob illustrated this with an analogy: if you walk up to a building and see its architecture, you can often tell whether it is a library, school or office instantly. The same should apply to your architecture.\nBusiness &amp; Domain Logic\nIn many projects, the file structures can be like this:\ncontrollers/\r\nservices/\r\nrepositories/\r\nmodels/\n\nThis structure describes technical roles and tells you that the system uses MVC (Model-View-Controller), but it doesn’t tell you how it handles financial data, user management or content creation.\nHere is an example of a structure that “screams” its intent using domain-driven principles:\n/src\r\n    /accounting\r\n        Ledger.cs\r\n        Transaction.cs\r\n        Account.cs\r\n        TaxService.cs\r\n    /sales\r\n        Order.cs\r\n        Invoice.cs\r\n        Customer.cs\r\n        DiscountPolicy.cs\n\nor:\n/src\r\n    /orders\r\n        OrderController.cs\r\n        OrderService.cs\r\n        OrderRepository.cs\r\n        Order.cs\r\n        OrderItem.cs\r\n    /inventory\r\n        InventoryController.cs\r\n        InventoryService.cs\r\n        InventoryRepository.cs\r\n        InventoryItem.cs\n"},"index":{"slug":"index","filePath":"index.md","title":"Welcome","links":["Notes/","tags/recipe","tags/gaming","MetaIdle","Keyboard-Warrior","Pokemon-RPG-Maker-XP-fan-project"],"tags":[],"content":"\n\n                  \n                  The Dinonomicon \n                  \n                \n\nIn a world of scarcity, we treasure tools.\nIn a world of abundance, we treasure taste.\n— by Anu Atluru\n\n\nWelcome to Dino’s own Obsidian vault, powered and available online thanks to Quartz. Call it a blog, digital garden, personal knowledge management, second brain or even portfolio (that’s my actual portfolio) — what it is, it’s a look into my thoughts.\nCode snippets, research notes, cooking recipes, gaming stuff. You’ll find everything I have written down, here. It might be useful to you, or not.\nBut what you must be asking yourself is… who even is Dino?\n\n        \n        \n        \n            Dino\n                        \n                              Designer\n                              Developer\n                              Maker\n                              Gamer\n                        \n            Thaaat&#039;s me. I like to cook, build, play games, read. And then write about it here.\n        \n                \n                    \n                        \n                        \n                        \n                    \n                \n\nRead about my current projects:\n\nMetaIdle\nKeyboard Warrior\nPokemon RPG Maker XP fan project\n\nTodo:\n\nlogo\ndescription for folders ?\nlink socials on bottom of page\n"}}