{"Keystone-Correction":{"slug":"Keystone-Correction","filePath":"Keystone Correction.md","title":"Keystone Correction","links":["Lens-shift-function"],"tags":["projector","research"],"content":"When a projector is placed at an angle to the screen, the projected image becomes distorted into a trapezoid shape instead of a rectangle.\nThis distortion is called keystone effect.\nKeystone correction is the method of adjusting the image so it appears rectangular again.\nThere are several types of keystone correction.\nTypes of Keystone Correction\nVertical Keystone\nVertical keystone correction fixes distortion when the projector is too high (ceiling mounted) or too low (table placement) relative to the screen.\nHorizontal Keystone\nHorizontal keystone correction fixes distortion when the projector is placed to the left or right of the screen’s center.\n4-Point (Corner) Keystone\n4-point keystone allows adjustment of each corner of the image independently. This makes it possible to correct both vertical and horizontal distortions at once and adapt to uneven projection surfaces.\nAuto Keystone\nAuto keystone uses sensors to detect the angle of the projector and automatically corrects the distortion.\nLens Shift (Optical Alternative)\nLens shift is not digital correction but a mechanical adjustment that moves the lens up/down or left/right to align the image.\nBecause it is optical, there is no scaling and no loss in image quality. It is available mainly in higher-end projectors."},"Lens-shift-function":{"slug":"Lens-shift-function","filePath":"Lens-shift function.md","title":"Lens-shift function","links":["Keystone-correction"],"tags":["projector","research"],"content":"Lens shift is a mechanical adjustment in a projector that moves the lens inside the projector housing. By shifting the lens up, down, left, or right, the image position on the screen can be changed without tilting the projector and without introducing trapezoid distortion.\nUnlike digital keystone correction, lens shift preserves the full resolution and image quality because no digital scaling is applied.\nTypes of Lens Shift\nVertical Lens Shift\nVertical lens shift moves the image up or down on the screen.\nHorizontal Lens Shift\nHorizontal lens shift moves the image left or right. Usually offers a smaller adjustment range than vertical shift.\nCombined (Vertical + Horizontal)\nSome projectors provide both vertical and horizontal lens shift. This combination gives maximum flexibility, allowing placement above, below, or to the side of screen center without compromising image quality."},"Projector-light-sources":{"slug":"Projector-light-sources","filePath":"Projector light sources.md","title":"Projector light sources","links":[],"tags":["projector","research"],"content":"Projector light sources fall into two broad families: traditional lamp-based sources and solid-state sources.\nLamp-based sources use a replaceable bulb that produces light through electric discharge in a gas and metal salts.\nSolid-state sources use semiconductor devices such as LEDs or lasers to create light without a conventional bulb.\nTypes of light sources\nLamp-based\nLamp-based projectors typically require a warm-up period to reach stable brightness and they lose brightness gradually as the lamp ages. Lamps have a limited rated life, often between 2,000 and 5,000 hours in average consumer and business models, and sometimes more with eco modes. Lamp replacement is a recurring maintenance cost and proper disposal is necessary because some lamps contain mercury or other hazardous materials.\nLamp-based systems are the oldest and were the standard for many years. The common variants are Ultra High Performance (UHP) lamps, metal halide, and xenon arc lamps.\nUHP and metal halide lamps deliver high peak brightness and have been widely used in consumer, education, and business projectors.\nXenon arc lamps, which are rarer in small projectors, have been common in cinema projectors and in specialized high-color-accuracy applications.\nLED\nLED projectors use arrays of high-power LEDs as the light source. LEDs provide very long operating life compared to lamps and maintain color stability over time. They reach usable brightness instantly and support instant on/off operation without warm-up. LED-based projectors are compact and energy efficient, and they produce less heat.\nThe main limitation for LED projectors has historically been maximum brightness. Consumer and portable LED projectors are excellent for small- to medium-size screens and for dark to moderately lit rooms, but they struggle in very bright environments unless paired with a smaller screen or very close throw distances. LEDs typically advertise lifespans in the tens of thousands of hours, commonly 20,000 to 30,000 hours for many models.\nLaser\nLaser sources are solid-state, with long rated lifetimes often quoted in the tens of thousands of hours, and they provide near-instant on/off capability, minimal drift in color and brightness, and lower maintenance because there is no replaceable bulb. Lasers can achieve much higher lumen outputs than LED, making them ideal for bright-room and large-screen applications.\nLaser projectors come in multiple flavors:\nDirect RGB laser\nRGB laser projectors use separate red, green, and blue laser emitters to generate light directly. These systems offer the best color gamut and can reach very high brightness.\nBlue laser with phosphor\nBlue-laser plus phosphor systems use blue lasers to excite a phosphor wheel that emits yellow light which, combined with the remaining blue, creates full-color images. This approach scales well to very high brightness levels and is common in large venue and cinema-class projectors.\nLaser-phosphor\nLaser-phosphor is technically a hybrid in the sense that a laser pumps a phosphor to create broad-spectrum white light that is then used by the projector engine."},"Screaming-Architecture":{"slug":"Screaming-Architecture","filePath":"Screaming Architecture.md","title":"Screaming Architecture","links":[],"tags":["software-development","design","architecture"],"content":"Screaming Architecture is a concept introduced by renowned software developer and thought leader Robert C. Martin, often referred to as “Uncle Bob”.\nAs the name suggests, it is a principle in software design focusing on making the features of your system the primary concern of your architecture. Your software architecture should “scream” its intent and purpose.\nWhy “Screaming” Architecture?\nThe idea is that the structure of your codebase should immediately convey its business purpose. This goes against traditional architectures, as they emphasize the technical aspect of it. Uncle Bob illustrated this with an analogy: if you walk up to a building and see its architecture, you can often tell whether it is a library, school or office instantly. The same should apply to your architecture.\nBusiness &amp; Domain Logic\nIn many projects, the file structures can be like this:\ncontrollers/\nservices/\nrepositories/\nmodels/\n\nThis structure describes technical roles and tells you that the system uses MVC (Model-View-Controller), but it doesn’t tell you how it handles financial data, user management or content creation.\nHere is an example of a structure that “screams” its intent using domain-driven principles:\n/src\n    /accounting\n        Ledger.cs\n        Transaction.cs\n        Account.cs\n        TaxService.cs\n    /sales\n        Order.cs\n        Invoice.cs\n        Customer.cs\n        DiscountPolicy.cs\n\nor:\n/src\n    /orders\n        OrderController.cs\n        OrderService.cs\n        OrderRepository.cs\n        Order.cs\n        OrderItem.cs\n    /inventory\n        InventoryController.cs\n        InventoryService.cs\n        InventoryRepository.cs\n        InventoryItem.cs\n"},"Throw-correction":{"slug":"Throw-correction","filePath":"Throw correction.md","title":"Throw correction","links":[],"tags":["projector","research"],"content":"Throw correction refers to a projector’s ability to adjust the image size and placement relative to the distance between the projector and the screen, without having to physically move the projector.\nIt is closely related to the concept of throw ratio, which defines how wide the image will be at a given distance.\nThrow correction is usually achieved with a zoom lens or variable optics that allow users to fine-tune the image size. Some projectors are designed with short throw or ultra-short throw lenses to project large images from very close distances.\nThe flexibility of throw correction directly affects installation options in different environments.\nTypes of Throw Correction\nOptical Zoom (Variable Throw)\nAn optical zoom lens allows the image size to be increased or decreased by adjusting the lens, without moving the projector. The zoom range is expressed as a ratio (e.g. 1.2x, 1.6x).\nFixed Throw (No Zoom)\nSome projectors, especially budget models and portable units, have a fixed throw ratio with no zoom adjustment. The only way to change image size is by moving the projector closer or farther from the screen.\nShort Throw\nShort throw projectors have specially designed lenses that project large images from a short distance (e.g. 100-inch image from 1–2 meters).\nUltra-Short Throw (UST)\nUltra-short throw projectors can sit just a few centimeters from the wall or screen and still project very large images."},"index":{"slug":"index","filePath":"index.md","title":"Welcome","links":[],"tags":[],"content":"\n\n                  \n                  The Dinonomicon \n                  \n                \n\nIn a world of scarcity, we treasure tools.\nIn a world of abundance, we treasure taste.\n— by Anu Atluru\n\n\nWelcome to Dino’s own Obsidian vault, powered and available online thanks to Quartz. Call it a blog, digital garden, second brain or even portfolio (that’s my actual portfolio) — what it is, it’s a look into my thoughts.\nCode snippets, research notes, cooking recipes, gaming stuff. You’ll find everything I have written down, here. It might be useful to you, or not.\nBut what you must be asking yourself is… who even is Dino?\n\n        \n        \n        \n            Dino\n                        \n                              Designer\n                              Developer\n                              Maker\n                              Gamer\n                        \n            Thaaat&#039;s me. My hobbies are cooking, gaming, watching / reading media and building cool things.\n        \n"}}